$(window).load(function(){

    $(".l-overlay-loading").delay(3500).velocity({
        top: "-100%"
    }, {
        duration: 1000,
        easing: "easeInOut",
        complete: function(){
            // $("html, body").scrollTop(0);
            $("html").removeClass("is-loading");
        }
    });

    /*------------------------------------------------------------------
        縦スクロールをリセット
    ------------------------------------------------------------------*/
    setTimeout(function(){
        $("html, body").scrollTop(0);
    }, 0);

    /*------------------------------------------------------------------
        lettering
    ------------------------------------------------------------------*/
    $(".js-lettering").lettering();

    /*------------------------------------------------------------------
        Set text size
    ------------------------------------------------------------------*/
    $(".js-fittext-container").fitText();
});